photoapp/app/controllers/registrations_controller.rb

  def create
    build_resource(sign_up_params)

    resource.class.transaction do
      resource.save
      yield resource if block_given?
      if resource.persisted?
        @payment = Payment.new(
          {
            email: params['user']['email'],
            token: params[:payment]['token'],
            user_id: resource.id
          })

        flash[:error] = "Please check registration errors" unless @payment.valid?

        begin
          @payment.process_payment
          @payment.save
        rescue Exception => e
          flash[:error] = e.message

          resource.destroy
---
INSERT INTO "payments" ("email", "token", "user_id", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?)  [["email", "justicea83+test6@gmail.com"], ["token", "[FILTERED]"], ["user_id", 2], ["created_at", "2023-01-30 01:41:43.785036"], ["updated_at", "2023-01-30 01:41:43.785036"]]
DELETE FROM "users" WHERE "users"."id" = ?  [["id", 2]]